# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

ch: 4
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]  # 0-P1/2
  - [0, 1, SilenceChannel, [0,3]]  # 1-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 3-P2/4
  - [-1, 3, C2f_RAB, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P3/8
  - [-1, 6, C2f_RAB, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, CSP_PTB, [512, 0.25, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, CSP_PTB, [1024, 0.5, True]]  #10
  - [-1, 1, SPPF, [1024, 5]]  #11

  - [0, 1, SilenceChannel, [3,4]]  # 12-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 13-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 14-P2/4
  - [-1, 3, C2f_RAB, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 16-P3/8
  - [-1, 6, C2f_RAB, [256, True]]  #17
  - [-1, 1, Conv, [512, 3, 2]]  # 18-P4/16
  - [-1, 6, CSP_PTB, [512, 0.25, True]]   #19
  - [-1, 1, Conv, [1024, 3, 2]]  # 20-P5/32
  - [-1, 3, CSP_PTB, [1024, 0.5, True]]    #21
  - [-1, 1, SPPF, [1024, 5]]  #22

# YOLOv8.0n head
head:
  - [8, 1, Conv, [256, 3, 2]] # 23-P5/32
  - [[-1, 22], 1, asf_attention_model, []] # 24
  - [-1, 3, CSP_MutilScaleEdgeInformationSelect, [512]] # 25-P5/32

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26-P4/16
  - [6, 1, Conv, [128, 3, 2]] # 27-P4/16
  - [[-1, -2, 19], 1, asf_attention_model_x3, []] # 28
  - [-1, 3, CSP_MutilScaleEdgeInformationSelect, [512]] # 29-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 30-P3/8
  - [4, 1, Conv, [64, 3, 2]] # 31-P3/8
  - [[-1, -2, 17], 1, asf_attention_model_x3, []] # 32
  - [-1, 3, CSP_MutilScaleEdgeInformationSelect, [256]] # 33-P3/8

  - [[30, -1], 1, asf_attention_model, []] # 34
  - [-1, 3, CSP_MutilScaleEdgeInformationSelect, [256]] # 35-P3/8

  - [33, 1, Conv, [256, 3, 2]] # 36-P4/16
  - [35, 1, Conv, [256, 3, 2]] # 37-P4/16
  - [[-1, -2, 29, 26], 1, asf_attention_model_x4, []] # 38-P4/16
  - [-1, 3, CSP_MutilScaleEdgeInformationSelect, [512]] # 39-P4/16

  - [29, 1, Conv, [512, 3, 2]] # 40-P5/32
  - [39, 1, Conv, [512, 3, 2]] # 41-P5/32
  - [[-1, -2, 11], 1, asf_attention_model_x3, []] # 42-P5/32
  - [-1, 3, CSP_MutilScaleEdgeInformationSelect, [512]] # 43-P5/32

  - [[35, 39, 43], 1, Detect, [nc]]  # Detect(P3, P4, P5)
